#+title: Installing a go binary
#+subtitle: right from the source
#+tags[]: golang
#+date: 2024-06-16T21:08:50

* Where are the files going to be installed?

#+begin_src bash :results outout
  go env GOBIN
#+end_src

#+RESULTS:
: /Users/wschenk/bin

#+begin_src bash :results output
  ls -l $(go env GOBIN)/go-org
#+end_src

#+RESULTS:
: ls: /Users/wschenk/bin/go-org: No such file or directory

* Install

Make sure to use the =@latest= version if you don't have a particular
one in mind.

#+begin_src bash
  go install github.com/niklasfasching/go-org@latest
#+end_src

#+RESULTS:
: go: downloading github.com/niklasfasching/go-org v1.7.0
: go: downloading github.com/alecthomas/chroma/v2 v2.5.0
: go: downloading golang.org/x/net v0.0.0-20201224014010-6772e930b67b
: go: downloading github.com/dlclark/regexp2 v1.4.0
#+end_src

* Thats it

#+begin_src bash :results raw
  which go-org
#+end_src

#+RESULTS:
: /Users/wschenk/bin/go-org




